[
  {
    "title": "What is the difference between a stack and a queue in Java?",
    "type": "Java",
    "options": {
      "A": "A stack is a linear data structure where elements are added and removed from the top, while a queue is a linear data structure where elements are added from the rear and removed from the front.",
      "B": "A stack is a linear data structure where elements are added from the rear and removed from the front, while a queue is a linear data structure where elements are added and removed from the top.",
      "C": "A stack is a non-linear data structure where elements are accessed in a random order, while a queue is a linear data structure where elements are added and removed in a specific order.",
      "D": "A stack and a queue are two terms used interchangeably to describe the same type of data structure."
    },
    "answer": {
      "option": "A",
      "explanation": "A stack is a data structure that follows the Last-In-First-Out (LIFO) principle, while a queue follows the First-In-First-Out (FIFO) principle. In a stack, elements are added and removed from the top, while in a queue, elements are added from the rear and removed from the front."
    }
  },
  {
    "title": "What is the purpose of the \"super\" keyword in Java?",
    "type": "Java",
    "options": {
      "A": "The \"super\" keyword is used to call a method in the superclass.",
      "B": "The \"super\" keyword is used to refer to the current object.",
      "C": "The \"super\" keyword is used to declare a method as static.",
      "D": "The \"super\" keyword is used to declare a variable as constant."
    },
    "answer": {
      "option": "A",
      "explanation": "The \"super\" keyword is used to call a method in the superclass. It is used when a method in a subclass has the same name as a method in its superclass and you want to call the superclass method from the subclass method."
    }
  },
  {
    "title": "What is a constructor in Java?",
    "type": "Java",
    "options": {
      "A": "A constructor is a method that is used to initialize an object.",
      "B": "A constructor is a method that is used to destroy an object.",
      "C": "A constructor is a method that is used to access a class variable.",
      "D": "A constructor is a method that is used to override a superclass method."
    },
    "answer": {
      "option": "A",
      "explanation": "A constructor is a special method that is used to initialize an object. It has the same name as the class and is called automatically when an object is created."
    }
  },
  {
    "title": "What is the difference between an abstract class and an interface in Java?",
    "type": "Java",
    "options": {
      "A": "An abstract class is a class that cannot be instantiated, while an interface is a collection of abstract methods that can be implemented by a class.",
      "B": "An abstract class is a class that can be instantiated, while an interface is a collection of concrete methods that can be implemented by a class.",
      "C": "An abstract class is a class that can be inherited by a subclass, while an interface is a class that cannot be inherited.",
      "D": "An abstract class is a class that can only be accessed within the same package, while an interface can be accessed from any package."
    },
    "answer": {
      "option": "A",
      "explanation": "An abstract class is a class that cannot be instantiated, which means you cannot create an object from it directly. On the other hand, an interface is a collection of abstract methods that can be implemented by a class. A class can implement multiple interfaces, but can only extend one abstract class. "
    }
  },
  {
    "title": "What is a package in Java?",
    "type": "Java",
    "options": {
      "A": "A package is a collection of classes and interfaces.",
      "B": "A package is a collection of methods and variables.",
      "C": "A package is a collection of objects and arrays.",
      "D": "A package is a collection of loops and conditions."
    },
    "answer": {
      "option": "A",
      "explanation": "A package is a way of organizing related classes and interfaces. It helps to avoid naming conflicts and makes it easier to locate and reuse code. A package can contain other packages, as well as classes, interfaces, and other resources."
    }
  },
  {
    "title": "What is a synchronized method in Java?",
    "type": "Java",
    "options": {
      "A": "A synchronized method is a method that can be called by multiple threads simultaneously.",
      "B": "A synchronized method is a method that can only be accessed within the same class.",
      "C": "A synchronized method is a method that can only be accessed within the same package.",
      "D": "A synchronized method is a method that can only be accessed by one thread at a time."
    },
    "answer": "D",
    "explanation": "A synchronized method is a method that can only be accessed by one thread at a time to prevent concurrent access and modification of shared resources."
  },
  {
    "title": "What does the \"static\" keyword mean in Java?",
    "type": "Java",
    "options": {
      "A": "The static keyword is used to declare variables that can only be accessed within the same class.",
      "B": "The static keyword is used to indicate that a method cannot be overridden in a subclass.",
      "C": "The static keyword is used to declare a class that cannot be instantiated.",
      "D": "The static keyword is used to indicate that a method or variable belongs to the class itself, rather than an instance of the class."
    },
    "answer": "D",
    "explanation": "The static keyword is used to indicate that a method or variable belongs to the class itself, rather than an instance of the class. Static methods and variables can be accessed without creating an instance of the class."
  },
  {
    "title": "What is the difference between an array and an ArrayList in Java?",
    "type": "Java",
    "options": {
      "A": "An array is a fixed size data structure, while an ArrayList can grow or shrink dynamically.",
      "B": "An array can store only primitive data types, while an ArrayList can store any object.",
      "C": "An array is a one-dimensional data structure, while an ArrayList is a multi-dimensional data structure.",
      "D": "An array is a collection of objects, while an ArrayList is a collection of classes."
    },
    "answer": "A",
    "explanation": "An array is a fixed size data structure that stores a collection of elements of the same data type. An ArrayList, on the other hand, can grow or shrink dynamically and can store any type of object."
  },
  {
    "title": "What is the purpose of the \"final\" keyword in Java?",
    "type": "Java",
    "options": {
      "A": "The \"final\" keyword is used to indicate that a method cannot be overridden in a subclass.",
      "B": "The \"final\" keyword is used to indicate that a variable cannot be changed after it is initialized.",
      "C": "The \"final\" keyword is used to indicate that a class cannot be inherited by a subclass.",
      "D": "The \"final\" keyword is used to indicate that a method can only be accessed by the same class."
    },
    "answer": "B",
    "explanation": "In Java, the \"final\" keyword can be used to declare a variable constant, which means that once initialized, its value cannot be changed. This is useful for creating variables that should not be modified throughout the program, such as mathematical constants or configuration settings."
  },
  {
    "title": "What is a try-catch block in Java?",
    "type": "Java",
    "options": {
      "A": "A try-catch block is used to declare a method as static.",
      "B": "A try-catch block is used to declare a method as final.",
      "C": "A try-catch block is used to handle exceptions in Java.",
      "D": "A try-catch block is used to declare a method as synchronized."
    },
    "answer": "C",
    "explanation": "In Java, a try-catch block is used to handle exceptions that may occur during program execution. The try block contains the code that may throw an exception, while the catch block contains the code that handles the exception. If an exception is thrown in the try block, the catch block is executed to handle the exception, preventing the program from crashing or producing incorrect results."
  }
]